{"pages":[],"posts":[{"title":"「 今天也要开心呐 」- 2月总结","text":"本站用于记录日常，其他博文更新在星云C馆 欢迎来看233 https://www.m78.co/2020年一开始就因为疫情问题，一直宅在家23333，虽然说我是死宅，但经常呆在家也会闲出问题啊 武汉加油！ 中国加油！ 我校也先后开展了网课工作，很明显感受出网课除了作业量和需要长时间盯着屏幕以外，比学校生活轻松一点。我妈自从疫情开始，就沉迷上了织毛衣，emmmm拆了织，织了拆.. MC2月快结束了，在几天前，18日，我收到了chxsb的这样一条消息 程华轩 2020-02-18 13:26:39搞个mc服务器吗 我处于完全摸不到头的情况，2020还搞mc私服?说起来搞的今年是文艺复兴一样，许许多多小服活了起来，并有着稍微稳定的玩家群体。再说网易我的世界，之前由MBLIH邀请我参与网易所提供的apollo开发，因其奇怪的机制，都找不到开发者愿意去了解api去做服务器，从网易的人一句草草的不同意使用nk，结束。 再说回chx，chx跟我说考虑的第一件事，居然是群组服的问题emmm，我觉得如今局势可以跑满一个服务器都不太可能，后来又看得出来他好像真的要搞，以彼岸倾城工作室的技术实力，要搞的话也不随随便便去做，根据chx的设想包含了生存、rpg、小游戏，在如今这个时代下出这样的决定，无疑很有勇气。 无论最终我们是会成为minori那种少数派，无论灭不灭亡，我们都缔造过传奇就足够了。 加油吧！ 测试机为了上面的服务器做测试，需要测试docker，搭建jenkins什么的，我就翻出了古董ThinkPad笔记本，然后用一个tplink的路由器桥接主路由(一个华为的，换的原因是因为有千兆口)，普联的东西还真可以，如果那个路由器不是因为是百兆，也不会换。桥接之后，无论是无线还是有线都达到了百兆带宽(博主家是300M的带宽)关于具体一些操作，我更新在了M78: https://www.m78.co/IT/docker.html 2333之前我好像也在itxe还更新过docker的文章 ThinkPHP由Grass企划的一个项目中，我终于担任了一会只负责后端的职位(虽然不知道以后怎么样)，他要求使用thinkphp，我对tp的理解还停留字tp3，tp5问世没怎么关注，如今都tp6了？抱着惊讶的态度，找到文档，刚看几眼就无语了，这mad不就是laravel。thinkphp在以前国内也是有着很大的用户群体，github star数也非常可观，如今这种情况是怎么回事？？抱着迟疑，以及这样不就省时间的想法，初始化了项目。接下来一堆无语的问题： php think run 启动失败？？php权限问题 再composer install一遍就好了？？ php think make:xxx 都不能使用… 一堆命名空间和路径乱写 我把vendor添加到phpstorm的依赖里，自动use出错，改成文档写的命名空间，看着一堆ide的错误提示，网站运行成功… 不仅路由，请求响应模型查询构造器这些基础的都与laravel 完 全 一 致 这还是我在写一个非常简单的登录注册 唉….. 但也没毛病，毕竟真谛是ctrl c/v (没有引战的意思，没有看过源代码 只是粗略看过文件结构和文档) 近期计划 重修 java 推荐java学习资料 https://www.zhihu.com/question/311758187/answer/617821335 https://www.liaoxuefeng.com/wiki/1252599548343744 顺便一提，今天好像是Photoshop诞生30周年","link":"/2020/02/21/2-21/"},{"title":"「 我感觉现在 离自己的梦想又近了一步 」","text":"我这次又打算写blog了，说起上次做自己的博客，大概还是在小学时期，使用的还是typecho，后来因为传统艺能咕咕咕了。如今希望可以坚持一段时间吧本次使用hexo部署在Github Page，后期再考虑是否迁到CodingPage，图片放到OSS什么的。 自我介绍LixWorth，编程与动漫爱好者，死宅。 现任 彼岸倾城工作室 盒子萌 首席技术一职 曾担任 MCPE服务器/面板的运维与插件开发 WEB全栈（其实一直都是偏向于后端，但因为种种原因经常在项目中担任主要前端） 柚子厨 KEY厨 ⁄(⁄⁄•⁄ω⁄•⁄⁄)⁄ 阅番无数 （不敢称 大概挺多的吧） 米卫兵 参与过的项目 … 过于久远 不提为好 McCandy 又是传统艺能 BoxMoe与彼岸倾城工作室各一系列项目 同样又是传统艺能 SteinsMC Amadeus 游戏服面板 …努力完善，不会咕的，应该ヾ(・ω・*)ノ 对于未来的目标2020年目标 熟练使用 Premiere Pro （因如今担任校电视台后期一职） 为学生会公众号从零开始做好运营一职 （曾经也自己搞过，应该不难吧） Unity基础 有可能的话了解一下乐理和 Fl studio 从一开始，我做这些都是因为爱好，希望在未来兼顾学业的同时，可以多学一些、多做一些我感兴趣的东西，加油吧！（FLAG立的满满的）","link":"/2020/02/17/first/"},{"title":"Hello World","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","link":"/2020/02/16/hello-world/"}],"tags":[{"name":"过去","slug":"过去","link":"/tags/%E8%BF%87%E5%8E%BB/"},{"name":"目标","slug":"目标","link":"/tags/%E7%9B%AE%E6%A0%87/"},{"name":"日常","slug":"日常","link":"/tags/%E6%97%A5%E5%B8%B8/"}],"categories":[{"name":"杂谈","slug":"杂谈","link":"/categories/%E6%9D%82%E8%B0%88/"}]}